app/controllers/api/v1/rounds_controller.rb

SELECT "rounds".* FROM "rounds" WHERE "rounds"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @round = Round.find(params[:id])