app/controllers/api/v1/rounds_controller.rb

SELECT "rounds".* FROM "rounds" ORDER BY "rounds"."created_at" DESC
---
  def index
    @rounds = Round.all.recent

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "user_rounds".* FROM "user_rounds" ORDER BY "user_rounds"."id" DESC LIMIT $1  [["LIMIT", 1]]
SELECT "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
  def show
    @user = User.find(params[:id])
    # options = {include: [:user_rounds]}
    @round = User.id.rounds.last

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]
INSERT INTO "rounds" ("title", "pick_one", "pick_two", "pick_three", "pick_four", "pick_five", "pick_six", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @user = User.find(params[:id])
    @round = @user.rounds.build(round_params)
    # binding.pry
    if @round.save

SELECT "rounds".* FROM "rounds" WHERE "rounds"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_round
    @round = Round.find(params[:id])