app/controllers/api/v1/users_controller.rb

  def create
    # emailcheck
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("email", "username") VALUES ($1, $2) RETURNING "id"  [["email", "Maria@test.com"], ["username", "Maria"]]